I have just observed the same issue (UUID-s anonymised):

```
Terraform planned the following actions, but then encountered a problem:

  # module.stack_platform.azurerm_role_assignment.avd_customer_as_application_group_user["90239023-9023-9023-9023-902390239023"] must be replaced
-/+ resource "azurerm_role_assignment" "avd_customer_as_application_group_user" {
      ~ id                                     = "/subscriptions/aaaaaaaa-bbbb-cccc-dddd-ffffffffffff/resourceGroups/rg-platform-mloskot-prd/providers/Microsoft.DesktopVirtualization/applicationGroups/dag-plt-uks-prd/providers/Microsoft.Authorization/roleAssignments/d7372b86-9396-57cc-b374-48e671234fa9" -> (known after apply)
      ~ name                                   = "d7372b86-9396-57cc-b374-48e671234fa9" -> (known after apply)
      ~ principal_id                           = "0b8f0b8f-0b8f-0b8f-0b8f-0b8f0b8f0b8f" -> "/groups/0b8f0b8f-0b8f-0b8f-0b8f-0b8f0b8f0b8f" # forces replacement
      ~ principal_type                         = "Group" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/aaaaaaaa-bbbb-cccc-dddd-ffffffffffff/providers/Microsoft.Authorization/roleDefinitions/1d18fff3-a72a-46b5-b4a9-0b38a3cd7e63" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
╷
│ Error: expected "group_object_id" to be a valid UUID, got /groups/0b8f0b8f-0b8f-0b8f-0b8f-0b8f0b8f0b8f
│
│   with module.stack_platform.azuread_group_member.avd_customer["90239023-9023-9023-9023-902390239023"],
│   on ../../../../modules/mloskot/azure/stack-platform/r-avd-users.tf line 78, in resource "azuread_group_member" "avd_customer":
│   78:   group_object_id  = azuread_group.avd_customer[each.value.ucid].id
│
╵
╷
│ Error: expected "member_object_id" to be a valid UUID, got /users/31783178-3178-3178-3178-317831783178
│
│   with module.stack_platform.azuread_group_member.avd_customer["90239023-9023-9023-9023-902390239023"],
│   on ../../../../modules/mloskot/azure/stack-platform/r-avd-users.tf line 79, in resource "azuread_group_member" "avd_customer":
│   79:   member_object_id = azuread_user.avd_customer[each.key].id
│
```

Refs:
- https://github.com/hashicorp/terraform-provider-azuread/issues/1500
- https://github.com/hashicorp/terraform-provider-azuread/issues/1505